src/test/java/examples/SOAPService/SOAPRequestWSSecurityUsername.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://apigw.random.com/countries">
   <soapenv:Header>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soapenv:mustUnderstand="1">
        <wsse:UsernameToken>
          <wsse:Username>boby</wsse:Username>
          <wsse:Password>youruncle</wsse:Password>
        </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <ns:getCountriesRequest>
      </ns:getCountriesRequest>
   </soapenv:Body>
</soapenv:Envelope>